#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/fa93b53b-6336-4100-a2ce-2f273c6916a8/resourceGroups/rg-dev-main]
module.network.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/fa93b53b-6336-4100-a2ce-2f273c6916a8/resourceGroups/rg-dev-main/providers/Microsoft.Network/virtualNetworks/vnet-dev-main]
module.network.azurerm_subnet.subnet["subnet-1"]: Refreshing state... [id=/subscriptions/fa93b53b-6336-4100-a2ce-2f273c6916a8/resourceGroups/rg-dev-main/providers/Microsoft.Network/virtualNetworks/vnet-dev-main/subnets/subnet-1]
module.network.azurerm_subnet.subnet["subnet-2"]: Refreshing state... [id=/subscriptions/fa93b53b-6336-4100-a2ce-2f273c6916a8/resourceGroups/rg-dev-main/providers/Microsoft.Network/virtualNetworks/vnet-dev-main/subnets/subnet-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.keyvault_name will be created
  + resource "random_string" "keyvault_name" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.keyvault.azurerm_key_vault.vault will be created
  + resource "azurerm_key_vault" "vault" {
      + access_policy               = (known after apply)
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "eastus2"
      + name                        = (known after apply)
      + purge_protection_enabled    = false
      + resource_group_name         = "rg-dev-main"
      + sku_name                    = "standard"
      + soft_delete_retention_days  = 7
      + tags                        = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
        }
      + tenant_id                   = "097cc2fc-b9fb-4f07-80b7-eab5694ad4fc"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + key_vault_id            = (known after apply)
  ~ key_vault_name          = "kv-dev-main" -> (known after apply)
  + key_vault_uri           = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>